---
title: RebarShapeFailures
classe: Autodesk.Revit.DB.BuiltInFailures+RebarShapeFailures
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 20
---

# RebarShapeFailures

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `FailureDefinitionId CircleMultiPlanarShape { get; }` | `RebarShapeFailures.CircleMultiPlanarShape` | FailureDefinitionId |
| `FailureDefinitionId CircleUnbounded { get; }` | `RebarShapeFailures.CircleUnbounded` | FailureDefinitionId |
| `FailureDefinitionId CurveOverconstrained { get; }` | `RebarShapeFailures.CurveOverconstrained` | FailureDefinitionId |
| `FailureDefinitionId CurvesCollinear { get; }` | `RebarShapeFailures.CurvesCollinear` | FailureDefinitionId |
| `FailureDefinitionId CurvesUnlooped { get; }` | `RebarShapeFailures.CurvesUnlooped` | FailureDefinitionId |
| `FailureDefinitionId CurveUnderconstrained { get; }` | `RebarShapeFailures.CurveUnderconstrained` | FailureDefinitionId |
| `FailureDefinitionId DefaultParamaterValuesIncorrect { get; }` | `RebarShapeFailures.DefaultParamaterValuesIncorrect` | FailureDefinitionId |
| `FailureDefinitionId DepthDimensionNotExisted { get; }` | `RebarShapeFailures.DepthDimensionNotExisted` | FailureDefinitionId |
| `FailureDefinitionId DiagonalEdgesAreUnderconstrained { get; }` | `RebarShapeFailures.DiagonalEdgesAreUnderconstrained` | FailureDefinitionId |
| `FailureDefinitionId DimensionLoose { get; }` | `RebarShapeFailures.DimensionLoose` | FailureDefinitionId |
| `FailureDefinitionId DimensionWithCommonLengthUnit { get; }` | `RebarShapeFailures.DimensionWithCommonLengthUnit` | FailureDefinitionId |
| `FailureDefinitionId DimensionWithoutParameter { get; }` | `RebarShapeFailures.DimensionWithoutParameter` | FailureDefinitionId |
| `FailureDefinitionId FormulaDrivenDimension { get; }` | `RebarShapeFailures.FormulaDrivenDimension` | FailureDefinitionId |
| `FailureDefinitionId HooksAndEndTreatmentAtTheSameEnd { get; }` | `RebarShapeFailures.HooksAndEndTreatmentAtTheSameEnd` | FailureDefinitionId |
| `FailureDefinitionId MultiPlanarDepth { get; }` | `RebarShapeFailures.MultiPlanarDepth` | FailureDefinitionId |
| `FailureDefinitionId MultipleArcsMustOverlap { get; }` | `RebarShapeFailures.MultipleArcsMustOverlap` | FailureDefinitionId |
| `FailureDefinitionId ParameterValueNotDefined { get; }` | `RebarShapeFailures.ParameterValueNotDefined` | FailureDefinitionId |
| `FailureDefinitionId PlanarMultiPlanarShape { get; }` | `RebarShapeFailures.PlanarMultiPlanarShape` | FailureDefinitionId |
| `FailureDefinitionId ShapeFailure { get; }` | `RebarShapeFailures.ShapeFailure` | FailureDefinitionId |
| `FailureDefinitionId WrongDepthDimensionLabel { get; }` | `RebarShapeFailures.WrongDepthDimensionLabel` | FailureDefinitionId |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```